src/InformationRegisters/ПараметрыСинхронизацииАвтономныхКопий/ПараметрыСинхронизацииАвтономныхКопий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыСинхронизацииАвтономныхКопий</name>
  <resources>
    <name>СценарийПереданныхДанных</name>
    <type>
      <types>EnumRef.СценарииСинхронизацииАвтономныхКопий</types>
    </type>
  </resources>
  <resources>
    <name>СценарийЗапрашиваемыхДанных</name>
    <type>
      <types>EnumRef.СценарииСинхронизацииАвтономныхКопий</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидПериода</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьОтборПоКошелькам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КлючОтбораПоКошелькам</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПрежнееСценарийПереданныхДанных</name>
    <type>
      <types>EnumRef.СценарииСинхронизацииАвтономныхКопий</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрежнееСценарийЗапрашиваемыхДанных</name>
    <type>
      <types>EnumRef.СценарииСинхронизацииАвтономныхКопий</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрежнееКоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрежнееВидПериода</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрежнееУчитыватьОтборПоКошелькам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрежнееКлючОтбораПоКошелькам</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.МобильноеПриложение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПараметрыСинхронизацииАвтономныхКопий/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеВидимостьюСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УзелПриИзменении(Элемент)
	УправлениеВидимостьюСервер();
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюСервер()
	
	Элементы.КоличествоПериодов.Доступность        = Запись.Узел.МобильноеУстройство;
	Элементы.ВидПериода.Доступность                = Элементы.КоличествоПериодов.Доступность;
	Элементы.ПрежнееКоличествоПериодов.Доступность = Элементы.КоличествоПериодов.Доступность;
	Элементы.ПрежнееВидПериода.Доступность         = Элементы.КоличествоПериодов.Доступность;
	
КонецПроцедуры
